---
kind: property
id: P:Autodesk.Revit.DB.TextNode.Text
source: html/311f1c76-832f-f53e-d2dc-44bc696caf72.htm
---
# Autodesk.Revit.DB.TextNode.Text Property

The content of the text annotation as a plain string stripped of all formatting.

## Syntax (C#)
```csharp
public string Text { get; }
```

## Remarks
The text may contain new-lines if there are any in the text annotation.